{
    "MWB": {
        "fullName": "Molly Wiltshire-Bridle",
        "url": "https://www.linkedin.com/in/molly-wiltshire-bridle/",
        "img": "molly.jpg",
        "title": "Global Growth Manager - Financial Niches",
        "company": "Finder.com",
        "text": "Zak is a rare breed of digital shapeshifter. You need only look at his remarkable trajectory within the business to see what I mean &ndash; from staff writer to full-stack publisher in a few short years. <br /><br />When I first onboarded Zak, I remember being struck by two things: an inquisitiveness (how does that work? Can we do it more efficiently? How can we measure success?) far beyond your average editorial recruit, and a knack for just &ldquo;getting it&rdquo; every time. His skill in breaking down complex financial topics certainly didn&rsquo;t go unnoticed either.<br /><br />Perhaps these were early hints of what an indelible path Zak would go on to forge. Over 4 years and dozens of projects, Zak became a go-to interface between content, product and engineering teams &ndash; often wearing several of these hats himself. Without Zak&rsquo;s unique convergence of technical publishing and communication skills, our lean team wouldn&rsquo;t have achieved such success on many of our colossal, cross-market projects (comprising tens of thousands of pages!). Scaling is Zak&rsquo;s superpower. When you think it can&rsquo;t be done, he finds a way &ndash; and then finds an even better one.<br /><br />To top it off, Zak is a total pleasure to collaborate with. He approaches every challenge with level-headedness, insight and empathy, never failing to ask &ldquo;how can I help?&rdquo;<br /><br />I wouldn&rsquo;t think twice about hiring Zak again &ndash; any company would be lucky to have him."
    },
    "GP": {
        "fullName": "Gabe Palomares",
        "url": "https://www.linkedin.com/in/gabepalomares/",
        "img": "gabe.jpg",
        "title": "Data/Technology Innovation Manager (Global)",
        "company": "Finder.com",
        "text": "I have had the distinct pleasure of working with Zak for the past three years. He is a standout digital product all-rounder emerging as a formidable web engineer and has consistently demonstrated excellence and dedication in his work.<br /><br />Zak's foray into the web engineering world has been impressive, with him working with our Engineering team. During his time, he has evolved into a formidable JavaScript engineer, mainly focusing on excellent front-end solutions, but he has also started to break into back-end work. Should he pursue a full-time Engineering path, I think he has an incredibly bright future with it.<br /><br />Zak's unique ability to act as a bridge between operations, product, and engineering teams sets him apart. He's effectively managed numerous complex technical projects and has been a tremendous technical product lead. His proactive communication style and knack for translating technical details into actionable insights significantly contributed to the overall success of our initiatives.<br /><br />Zak's inquisitive nature is one of his standout qualities. Always seeking ways to improve processes and maximize opportunities, Zak approaches challenges with a creative and solution-oriented mindset. His determination to squeeze every bit of potential from a task or project has been inspiring to witness and has undoubtedly elevated the overall performance of our team.<br /><br />Working with Zak has been a pleasure in every sense. His friendly and clear-headed approach to problem-solving creates a positive and collaborative atmosphere. He's a joy to work with.<br /><br />I believe Zak would make a fantastic, no-brainer addition to any digital product team, and I would wholeheartedly love the opportunity to work with him again."
    },
    "AT": {
        "fullName": "Adrian Tomkins",
        "url": "https://www.linkedin.com/in/adriantomkins/",
        "img": "adrian.jpg",
        "title": "Group Product Manager",
        "company": "Finder.com",
        "text": "Zak is an incredible executer. As his manager, I could always rely on him to handle projects end to end. From stakeholder management to defining technical solutions (and often implementing them in code himself), to working with various teams to roll them out, Zak can do it all. One such notable callout was when we were consolidating our country websites. We were required to present users from different geographic locations alternate product offerings. Not only did he define the approach, he built it and, working with the wider team, implemented it out across thousands of pages. Zak is absolutely the person you can provide a problem to, and he will deliver a well thought-out solution, on-time and without the need for oversight."
    },
    "RL": {
        "fullName": "Richard Laycock",
        "url": "https://www.linkedin.com/in/richardlaycock/",
        "img": "richard.jpg",
        "title": "Senior content manager & insights editor",
        "company": "Finder.com",
        "text": "Zak is one of the smartest people I have ever worked with and it has been a pleasure working with him over the last four years. <br /><br />His unique ability to distill technical projects into user-friendly solutions sets him apart from others. Zak's greatest strength lies in his ability to understand problems and requests, and find creative solutions. He is a magician when it comes to making things happen and scale. <br /><br />Not only does Zak excel in technical expertise, but he also spends a significant amount of time empowering and training others. And if he sees you working on a project that he can help out with, no matter how busy he is, he will reach out and offer his assistance. <br /><br />In addition to his technical prowess, Zak is an excellent communicator and has the ability to prioritize projects effectively. He is always willing to help and problem-solve, making him a go-to resource for many."
    },
    "ZA": {
        "fullName": "Zak Ali",
        "url": "https://www.linkedin.com/in/zak-ali-ab267777/",
        "img": "zak.jpg",
        "title": "Head of Growth",
        "company": "Finder.com",
        "text": "Zak Killermann is the bridge between Product &amp; Marketing that every company dreams of. His deep understanding of both content and product development made him uniquely capable of identifying areas for both growth and improvement. Couple this understanding with Zak's bias toward action, and you're dealing with a force to be reckoned with.<br /><br />Any organization seeking to accelerate their growth efforts would be privileged to count Zak among their ranks."
    },
    "JH": {
        "fullName": "Jaclyn Hurst",
        "url": "https://www.linkedin.com/in/jaclynhurst111/",
        "img": "jaclyn.jpg",
        "title": "Associate Publisher, Investments",
        "company": "Finder.com",
        "text": "Zak was truly the MVP of the company. He has the unique ability to take very technical projects and distill them down for ease-of-use and for anybody to understand. His greatest strength was to understand a problem or request and translate it into its technical components and then create a solution that was extremely efficient, productive and user friendly. When you came to Zak for a problem-solve, he would often say: \"Tell me exactly what you want, what the end goal is and I will make it happen\" - magic man!<br /><br />Zak almost spent a lot of his time empowering/training myself and others in order to share his knowledge and skills. Because of Zak, the company had efficient tools and solutions to scale elements of publishing to a global level. It's a special skill to be able to work in both a very technical world and business world and Zak merged the two worlds seamlessly. Zak is also a very strong communicator and can properly prioritize projects as he was often bombarded for his ability to help and problem solve.<br /><br />I highly recommend Zak for any role as he is smart, inventive, and extremely positive to work with. His skill set is invaluable as is the way he empowers the people he works with. MVP!"
    },
    "NT": {
        "fullName": "Nicole Tang",
        "url": "https://www.linkedin.com/in/nicoletang36/",
        "img": "nicole.jpg",
        "title": "Senior Program Manager",
        "company": "Finder.com",
        "text": "I&rsquo;ve had the pleasure to work with Zak across numerous projects within Global Financial Niches in Finder. Zak has an amazing ability find creative technical solutions to automate and scale a process out, all from just a few spreadsheets! I could always share a problem and rely on Zak to come back with a solution that would scale over time with limited oversight from his manager. <br /><br />On top of this, Zak&rsquo;s editorial and SEO skills make Zak an awesome all-rounder to have on any team."
    },
    "SL": {
        "fullName": "Shirley Liu",
        "url": "https://www.linkedin.com/in/shirleyliu5/",
        "img": "shirley.jpg",
        "title": "Chief of Staff",
        "company": "Finder.com",
        "text": "Zak has demonstrated an exceptional ability to manage Finder's global niches seamlessly. His keen insights and strategic approach have been instrumental in keeping our projects flowing smoothly across various international domains.<br /><br />I've witnessed Zak's remarkable growth during his transitions at Finder, particularly from his role as our Money Transfer writer to his current position, where he tackles and solves technical global problems that impact tens of thousands of pages. His dedication to continuously expanding his skillset and taking on new challenges has greatly contributed to the success of our projects."
    },
    "CL": {
        "fullName": "Chris Lilly",
        "url": "https://www.linkedin.com/in/chris-lilly-46a15627/",
        "img": "chris.jpg",
        "title": "Head of Publishing",
        "company": "Finder.com",
        "text": "I&rsquo;ve had the privilege of working with Zak on several ambitious cross-domain collaborations and I&rsquo;m frankly in awe of his technical ability! Zak has a the ability to creatively solve problems affecting different teams in different ways. When we believed we had hit potential dead ends on some key projects, Zak was able to implement ingenious yet practical solutions that empowered all teams involved to move forward with renewed energy."
    },
    "CM": {
        "fullName": "Casey McNulty",
        "url": "https://www.linkedin.com/in/casey-mcnulty-25a1292b/",
        "img": "casey.jpg",
        "title": "VP of Client Services",
        "company": "Finder.com",
        "text": "Zak is a standout technical SEO expert in that he has the rare ability (and patience!) to understand requests coming from very non-technical teams, synthesize those asks, and produce meaningful results. As an example, the sales team was seeing site leakage and revenue loss due to lack of geo-targeting. We presented this to Zak as an open-ended question - can you help us? He immediately understood the implications of the project and created a tool that effectively solved the problem and boosted revenue - a win for everyone. On top of his exceptional ability to deliver product solutions for every business problem, he's an amazing colleague and a wonderful person. I've really enjoyed working with him and am terribly jealous of whatever team he joins next!"
    },
    "CM": {
        "fullName": "Stacie Hurst",
        "url": "https://www.linkedin.com/in/stacie-hurst/",
        "img": "stacie.jpg",
        "title": "Associate Editor",
        "company": "Finder.com",
        "text": "Zak is an incredible force as a publisher &ndash; I can&rsquo;t recommend him highly enough! Over 3+ years of working at the same company, I saw him grow beyond his original roles as a writer, editor and web publisher to become one of the company&rsquo;s go-to resources for tackling complex technical challenges, specifically related to coding and producing programmatic pages (programmatic SEO).<br /><br />His work has played a major role in helping the company scale and simplify the publishing process, saving time and resources while jumping on new content opportunities.<br /><br />Having worked under him as an editor, I can testify to his supportive, positive leadership qualities and amazing work ethic. Zak is definitely an asset to any team!"
    },
    "MS": {
        "fullName": "Mario Solorza",
        "url": "https://www.linkedin.com/in/mario-a-solorza-castro/",
        "img": "mario.jpg",
        "title": "Graduate Publishing Support",
        "company": "Finder.com",
        "text": "I have had the distinct pleasure of working closely with Zak Killerman over the past 2 years, and I feel honored to write this recommendation for him.<br /><br />Zak is an exceptional programmer with an unparalleled commitment to knowledge sharing and mentorship. Throughout our time working together, Zak has played a pivotal role in my professional development. His ability to explain complex concepts in a clear and concise manner has been instrumental in helping me overcome a lot of the blockers I have encountered during my time working at Finder.<br /><br />What sets Zak apart is not just his technical expertise but his dedication to helping others learn and grow. Whenever I've encountered challenges or blockers, Zak has consistently been my go-to resource along with all the documentation he created. His willingness to lend a helping hand and patiently guide me through problem-solving has made a significant impact on my skill set and confidence as a programmer.<br /><br />Zak is not just a colleague; he is a trusted mentor who goes above and beyond to ensure that those around him succeed. His approachability and responsiveness make him an invaluable asset to any team. I can attest that Zak is not only an expert in his field but also someone who genuinely cares about the growth and success of his peers.<br /><br />I wholeheartedly recommend Zak Killerman to anyone seeking a knowledgeable, patient, and reliable mentor in the field. Working with Zak has been an enriching experience, and I am grateful for the guidance and support he has provided throughout our professional journey together."
    }
}